W8D1/reddit_clone/app/controllers/subs_controller.rb

    def update
        @sub = Sub.find(params[:id])
        if @sub.update(sub_params)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "It's good to read!!!"], ["updated_at", "2020-05-04 20:14:59.535421"], ["id", 1]]