W7D2/music_app/app/models/user.rb

    def reset_session_token!
        self.update!(session_token: self.class.generate_session_token)
---
UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "JUV4mxOzspMSgwxew_7M1w"], ["id", 1]]