W7D2/music_app/app/controllers/users_controller.rb

    def create
        #debugger
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("email", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["email", "red6@ya.com"], ["password_digest", "$2a$12$.P160gvd6ijdGxRxuLh7/O5gHazDb3y7ELGFamKPjEgpFoAeSk6M2"], ["session_token", "dHN-PlojyH6D4GCGQoSdlA"]]