W6D4/art_api_project/app/controllers/artwork_shares_controller.rb

    def index
        # render plain: "I'm in the index action!"
        @artwork_shares = ArtworkShare.all
---
SELECT "artwork_shares".* FROM "artwork_shares"

    def destroy
        @artwork_shares = ArtworkShare.find(params[:id])
        @artwork_shares.destroy
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 14]]

    def create
        @artwork_shares = ArtworkShare.create(artwork_shares_params)
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id") VALUES ($1, $2) RETURNING "id"  [["artwork_id", 6], ["viewer_id", 16]]