W6D4/art_api_project/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks"
---
    def index
        # render plain: "I'm in the index action!"
        if params[:user_id]
            @artworks = Artwork.all

INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "black circle"], ["image_url", "paintings.com/img/3"], ["artist_id", 18], ["created_at", "2020-04-23 20:44:01.378708"], ["updated_at", "2020-04-23 20:44:01.378708"]]
---
    def create
        #debugger
        @artworks = Artwork.new(artwork_params)
        if @artworks.save

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    def show
        #debugger
        @artworks = Artwork.find(params[:id])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "Black Circle"], ["updated_at", "2020-04-23 20:50:25.599098"], ["id", 7]]
---
    def update
        @artworks = Artwork.find(params[:id])
        if @artworks.update(artwork_params)

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 7]]
---
    def destroy
        @artworks = Artwork.find(params[:id])
        @artworks.destroy