W6D4/art_api_project/app/controllers/users_controller.rb

    def index
        # render plain: "I'm in the index action!"
        @users = User.all
---
SELECT "users".* FROM "users"

    def create
        #debugger
        @users = User.new(user_params)
        if @users.save
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "Alex Row"], ["created_at", "2020-04-23 19:03:03.623754"], ["updated_at", "2020-04-23 19:03:03.623754"]]

    def show
        #debugger
        @users = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

    def update
        @users = User.find(params[:id])
        if @users.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "Alex Dav"], ["updated_at", "2020-04-23 19:22:16.661782"], ["id", 21]]

    def destroy
        @users = User.find(params[:id])
        @users.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 20]]